# CMIFE-YOLO Ablation Study - Configuration (f): Full CMIFE-YOLO
# Full model: dual CMIFE at P3/P4/P5 + cross-scale global fusion + 2-head design
# Used for ablation study Table 4, ID (f) - This IS the full proposed model
# Expected: mAP@0.5 ≈ 33-35% (revised from 36.3% based on realistic FLOPs analysis)
#
# IMPORTANT NOTE ON TARGET METRICS:
#   The original paper draft claimed 36.3% mAP@0.5 with 4.9G FLOPs.
#   This is NOT achievable because:
#     1. Dual CMIFE modules add computational overhead
#     2. DeformableSpatialAttention is more expensive than 7x7 Conv
#     3. Cross-scale fusion adds extra operations
#   Realistic targets (first-run):
#     - mAP@0.5: 33-35%
#     - Params: ~3.2M
#     - FLOPs: ~8.5-9.5G
#     - FPS: ~90-110
#   If you achieve >35%, that would be exceptional.

nc: 10
scales:
  n: [0.50, 0.25, 1024]

backbone:
  - [-1, 1, Conv, [64, 3, 2]]          # 0
  - [-1, 1, Conv, [128, 3, 2]]         # 1
  - [-1, 2, C3k2, [256, False, 0.25]] # 2
  - [-1, 1, Conv, [256, 3, 2]]        # 3-P3/8  256ch
  - [-1, 2, C3k2, [512, False, 0.25]] # 4
  - [-1, 1, Conv, [512, 3, 2]]          # 5-P4/16 512ch
  - [-1, 2, C3k2, [512, True]]         # 6
  - [-1, 1, Conv, [1024, 3, 2]]        # 7-P5/32 1024ch
  - [-1, 2, C3k2, [1024, True]]        # 8
  - [-1, 1, SPPF, [1024, 5]]           # 9
  - [-1, 2, C2PSA, [1024]]             # 10

head:
  # ---- P3 path (80x80, small objects) ----
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 11: 20->40
  - [[-1, 6], 1, Concat, [1]]                   # 12
  - [-1, 2, C3k2, [512, False]]                  # 13

  - [-1, 1, Conv, [256, 3, 2]]                   # 14: 40->80
  - [[-1, 13], 1, Concat, [1]]                   # 15: concat P3(256)+P4(512)=768
  - [-1, 2, C3k2, [512, False]]                  # 16

  - [[3, 16], 1, CMIFE, [256]]                   # 17: Dual CMIFE-1 (P3 backbone + neck P3)
  - [-1, 1, CMIFE, [256]]                         # 18: Dual CMIFE-2

  # ---- P4 path (40x40, medium objects) ----
  - [-1, 1, Conv, [512, 3, 2]]                    # 19: 80->40
  - [[-1, 6], 1, Concat, [1]]                    # 20: concat P4(512)+down_P3(512)=1024
  - [-1, 2, C3k2, [512, False]]                  # 21

  - [[6, 21], 1, CMIFE, [512]]                   # 22: Dual CMIFE-1 (P4 backbone + neck P4)
  - [-1, 1, CMIFE, [512]]                         # 23: Dual CMIFE-2

  # ---- P5 path (20x20, large objects - for fusion only) ----
  - [-1, 1, Conv, [1024, 3, 2]]                   # 24: 40->20
  - [[-1, 10], 1, Concat, [1]]                    # 25: concat P5(1024)+down_P4(1024)=2048
  - [-1, 2, C3k2, [1024, True]]                   # 26

  - [[10, 26], 1, CMIFE, [512]]                   # 27: Dual CMIFE-1 (P5 backbone + neck P5)
  - [-1, 1, CMIFE, [512]]                          # 28: Dual CMIFE-2

  # ---- Cross-scale Global Fusion (Layer 29) ----
  # Unified fusion at P3 resolution (80x80) for maximum small object benefit
  - [[18, 23, 28], 1, CMIFE, [256]]               # 29: Cross-scale CMIFE

  # ---- Detection: 2-head design (P3 + P4, P5 removed) ----
  - [[29], 1, Detect, [nc]]                        # 30: P3 detection (small)
