# CMIFE-YOLO Ablation Study - Configuration (e): P3 + P4 + P5 dual CMIFE
# Adds dual CMIFE at all three detection levels.
# Used for ablation study Table 4, ID (e)
# Expected: mAP@0.5 ≈ 34.6%

nc: 10
scales:
  n: [0.50, 0.25, 1024]

backbone:
  - [-1, 1, Conv, [64, 3, 2]]
  - [-1, 1, Conv, [128, 3, 2]]
  - [-1, 2, C3k2, [256, False, 0.25]]
  - [-1, 1, Conv, [256, 3, 2]]
  - [-1, 2, C3k2, [512, False, 0.25]]
  - [-1, 1, Conv, [512, 3, 2]]
  - [-1, 2, C3k2, [512, True]]
  - [-1, 1, Conv, [1024, 3, 2]]
  - [-1, 2, C3k2, [1024, True]]
  - [-1, 1, SPPF, [1024, 5]]
  - [-1, 2, C2PSA, [1024]]

head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 6], 1, Concat, [1]]
  - [-1, 2, C3k2, [512, False]]

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, Concat, [1]]
  - [-1, 2, C3k2, [256, False]]

  # === Dual CMIFE at P3 ===
  - [[3, 16], 1, CMIFE, [256]]
  - [-1, 1, CMIFE, [256]]

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 13], 1, Concat, [1]]
  - [-1, 2, C3k2, [512, False]]

  # === Dual CMIFE at P4 ===
  - [[6, 20], 1, CMIFE, [512]]
  - [-1, 1, CMIFE, [512]]

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 10], 1, Concat, [1]]
  - [-1, 2, C3k2, [1024, True]]

  # === Dual CMIFE at P5 ===
  - [[10, 26], 1, CMIFE, [512]]
  - [-1, 1, CMIFE, [512]]

  - [[19, 22, 28], 1, Detect, [nc]]
