# Ultralytics YOLO 🚀, AGPL-3.0 license
# YOLO11 object detection model with P3-P5 outputs and CMIFE attention modules

# Parameters
nc: 10  # VisDrone数据集是10类，如果还是用80类可以不改
scales: # model compound scaling constants
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

# YOLO11n backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]]
  - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8
  - [-1, 2, C3k2, [512, False, 0.25]]
  - [-1, 1, Conv, [512, 3, 2]] # 5-P4/16
  - [-1, 2, C3k2, [512, True]]
  - [-1, 1, Conv, [1024, 3, 2]] # 7-P5/32
  - [-1, 2, C3k2, [1024, True]]
  - [-1, 1, SPPF, [1024, 5]] # 9
  - [-1, 2, C2PSA, [1024]] # 10

# YOLO11n head with CMIFE attention
head:
  # First upsampling path to P4
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 6], 1, Concat, [1]]  # cat backbone P4
  - [-1, 2, C3k2, [512, False]]  # 13

  # Second upsampling path to P3
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, Concat, [1]]  # cat backbone P3
  - [-1, 2, C3k2, [256, False]]  # 16 (P3/8-small)

  # CMIFE at P3 level - enhance small object features
  - [[3, 16], 1, CMIFE, [256]]  # 17 - takes backbone P3 (layer 3) and head P3 (layer 16) as input

  # Downsample to P4
  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 13], 1, Concat, [1]]  # cat head P4
  - [-1, 2, C3k2, [512, False]]  # 20 (P4/16-medium)

  # CMIFE at P4 level
  - [[6, 20], 1, CMIFE, [512]]  # 21 - takes backbone P4 (layer 6) and head P4 (layer 20) as input

  # Downsample to P5
  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 10], 1, Concat, [1]]  # cat head P5
  - [-1, 2, C3k2, [1024, True]]  # 24 (P5/32-large)

  # CMIFE at P5 level
  - [[10, 24], 1, CMIFE, [1024]]  # 25 - takes backbone P5 (layer 10) and head P5 (layer 24) as input

  # Detection head
  - [[17, 21, 25], 1, Detect, [nc]]  # Detect(P3, P4, P5)