# Ultralytics YOLO 🚀, AGPL-3.0 license
# CMIFE-YOLO v4: 保持标准YOLOv11n backbone (不变), 在neck正确加入CMIFE
# 核心思路: 不缩减backbone, 保证特征表达能力, CMIFE仅做特征增强
# 通道设计: 与YOLOv11n完全一致, CMIFE输入输出通道数=neck通道数

# Parameters
nc: 10  # VisDrone 10类
scales:
  n: [0.50, 0.25, 1024]  # 这里的width仅用于C3k2内部bottleneck, 不影响主通道

# YOLOv11n backbone (与原始YOLOv11n完全一致, 不做任何缩减)
backbone:
  - [-1, 1, Conv, [64, 3, 2]]        # 0-P1/2: 16→64
  - [-1, 1, Conv, [128, 3, 2]]       # 1-P2/4: 64→128
  - [-1, 2, C3k2, [256, False, 0.25]]  # 2: 128→256
  - [-1, 1, Conv, [256, 3, 2]]       # 3-P3/8: 256→256
  - [-1, 2, C3k2, [512, False, 0.25]]  # 4: 256→512
  - [-1, 1, Conv, [512, 3, 2]]       # 5-P4/16: 512→512
  - [-1, 2, C3k2, [512, True]]       # 6: 512→512 (bottleneck)
  - [-1, 1, Conv, [512, 3, 2]]       # 7-P5/32: 512→512
  - [-1, 2, C3k2, [512, True]]       # 8: 512→512 (bottleneck)
  - [-1, 1, SPPF, [512, 5]]           # 9: 512→512
  - [-1, 2, C2PSA, [512]]             # 10: 512→512

# CMIFE-YOLO v4 head (标准YOLOv11n neck + CMIFE增强)
head:
  # === FPN自顶向下路径 (与YOLOv11n完全一致) ===
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]   # 11
  - [[-1, 6], 1, Concat, [1]]                    # 12: 512+512=1024
  - [-1, 2, C3k2, [512, False]]                   # 13: 1024→512 (neck P4)

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]   # 14
  - [[-1, 4], 1, Concat, [1]]                     # 15: 512+512=1024
  - [-1, 2, C3k2, [256, False]]                   # 16: 1024→256 (neck P3)

  # === CMIFE增强 (仅在P3/P4层, 与标准neck通道完全一致) ===
  # CMIFE #1: 融合backbone_P3(256) + neck_P3(256) → 256ch (双输入门控融合)
  - [[3, 16], 1, CMIFE, [256]]   # 17
  # CMIFE #2: 单输入精炼 256 → 256 (级联增强小目标特征)
  - [-1, 1, CMIFE, [256]]         # 18

  # === PAN自底向上路径 (与YOLOv11n完全一致) ===
  - [-1, 1, Conv, [256, 3, 2]]                   # 19: 256→512
  - [[-1, 13], 1, Concat, [1]]                   # 20: 512+512=1024
  - [-1, 2, C3k2, [512, False]]                   # 21: 1024→512 (neck P4)

  - [-1, 1, Conv, [512, 3, 2]]                   # 22: 512→1024
  - [[-1, 10], 1, Concat, [1]]                   # 23: 1024+512=1536
  - [-1, 2, C3k2, [512, True]]                   # 24: 1536→512 (neck P5)

  # === 检测头 (P3增强 + P4 + P5) ===
  - [[18, 21, 24], 1, Detect, [nc]]  # 25
