# Ultralytics YOLO 🚀, AGPL-3.0 license
# CMIFE-YOLO v2: Enhanced Cross-scale Multi-level Information Fusion Enhancement
# 核心改进: CMIFE_v2模块(可变形空间注意力+局部-全局通道注意力+门控融合)
# 轻量化: 移除P5检测头, width=0.1875

# Parameters
nc: 10  # VisDrone 10类
scales:
  n: [0.50, 0.1875, 1024]  # depth=0.50, width=0.1875, max_channels=1024 (轻量化)
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

# YOLO11n backbone (保持原始结构)
backbone:
  - [-1, 1, Conv, [64, 3, 2]]       # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]      # 1-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]]  # 2
  - [-1, 1, Conv, [256, 3, 2]]      # 3-P3/8
  - [-1, 2, C3k2, [512, False, 0.25]]  # 4
  - [-1, 1, Conv, [512, 3, 2]]      # 5-P4/16
  - [-1, 2, C3k2, [512, True]]      # 6
  - [-1, 1, Conv, [1024, 3, 2]]     # 7-P5/32
  - [-1, 2, C3k2, [1024, True]]     # 8
  - [-1, 1, SPPF, [1024, 5]]        # 9
  - [-1, 2, C2PSA, [1024]]          # 10

# CMIFE-YOLO v2 head
head:
  # === FPN自顶向下路径 ===
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]   # 11
  - [[-1, 6], 1, Concat, [1]]                     # 12
  - [-1, 2, C3k2, [512, False]]                   # 13 (P4 head特征)

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]    # 14
  - [[-1, 4], 1, Concat, [1]]                     # 15
  - [-1, 2, C3k2, [256, False]]                   # 16 (P3 head特征)

  # === 改进1: P3层双CMIFE_v2增强 ===
  - [[3, 16], 1, CMIFE, [256]]    # 17 - 第一次: 融合backbone_P3 + head_P3
  - [-1, 1, CMIFE, [256]]         # 18 - 第二次: 精提炼 (串联增强)

  # === PAN自底向上路径 + 改进2: P4层双CMIFE_v2增强 ===
  - [-1, 1, Conv, [256, 3, 2]]                    # 19 - 下采样
  - [[-1, 13], 1, Concat, [1]]                    # 20
  - [-1, 2, C3k2, [512, False]]                   # 21 (P4融合特征)

  - [[6, 21], 1, CMIFE, [512]]    # 22 - 第一次: 融合backbone_P4 + head_P4
  - [-1, 1, CMIFE, [512]]         # 23 - 第二次: 精提炼 (串联增强)

  # === PAN继续 + 改进3: P5层双CMIFE_v2增强 ===
  - [-1, 1, Conv, [512, 3, 2]]                    # 24 - 下采样
  - [[-1, 10], 1, Concat, [1]]                    # 25
  - [-1, 2, C3k2, [1024, True]]                   # 26 (P5融合特征)

  - [[10, 26], 1, CMIFE, [1024]]  # 27 - 第一次: 融合backbone_P5 + head_P5
  - [-1, 1, CMIFE, [1024]]        # 28 - 第二次: 精提炼 (串联增强)

  # === 改进4: 跨尺度全局融合 ===
  - [[18, 23, 28], 1, CMIFE, [512]]  # 29 - 门控融合P3+P4+P5增强特征

  # === 检测头 (移除P5检测头实现轻量化，仅用P3+P4+全局融合) ===
  - [[18, 23, 29], 1, Detect, [nc]]  # 30
