# Ultralytics YOLO 🚀, AGPL-3.0 license
# CMIFE-YOLO v3: Plan B (width=0.25) + Plan A (精简CMIFE至2个)
# 核心改进: 仅在P3层做双级联CMIFE, 去除P4/P5/跨尺度CMIFE
# Backbone通道为v2的4/3倍, 给CMIFE足够通道发挥注意力效果

# Parameters
nc: 10  # VisDrone 10类
scales:
  n: [0.50, 0.25, 1024]  # v2用0.1875, v3放宽到0.25 (约4/3倍)
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

# YOLO11n backbone (width=0.25, 即v2通道的4/3倍)
backbone:
  - [-1, 1, Conv, [64, 3, 2]]        # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]       # 1-P2/4
  - [-1, 2, C3k2, [128, False, 0.25]]  # 2
  - [-1, 1, Conv, [256, 3, 2]]      # 3-P3/8
  - [-1, 2, C3k2, [256, False, 0.25]]  # 4
  - [-1, 1, Conv, [512, 3, 2]]      # 5-P4/16
  - [-1, 2, C3k2, [512, True]]      # 6
  - [-1, 1, Conv, [512, 3, 2]]       # 7-P5/32
  - [-1, 2, C3k2, [512, True]]      # 8
  - [-1, 1, SPPF, [512, 5]]          # 9
  - [-1, 2, C2PSA, [512]]            # 10

# CMIFE-YOLO v3 head
head:
  # === FPN自顶向下路径 ===
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]   # 11
  - [[-1, 6], 1, Concat, [1]]                    # 12: 256+256=512
  - [-1, 2, C3k2, [256, False]]                   # 13: 512→256

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]   # 14
  - [[-1, 4], 1, Concat, [1]]                     # 15: 256+128=384
  - [-1, 2, C3k2, [128, False]]                   # 16: 384→128

  # === 改进: 仅在P3层双CMIFE增强 (精简策略) ===
  # CMIFE #1: 双输入融合 backbone_P3(256) + neck_P3(128) → 256ch
  - [[3, 16], 1, CMIFE, [256]]   # 17
  # CMIFE #2: 单输入精炼 256 → 256 (级联增强P3小目标特征)
  - [-1, 1, CMIFE, [256]]         # 18

  # === PAN自底向上路径 (保持P3/P4/P5三个检测尺度) ===
  - [-1, 1, Conv, [128, 3, 2]]                    # 19
  - [[-1, 13], 1, Concat, [1]]                   # 20: 256+128=384
  - [-1, 2, C3k2, [256, False]]                  # 21: 384→256

  - [-1, 1, Conv, [256, 3, 2]]                    # 22
  - [[-1, 10], 1, Concat, [1]]                   # 23: 256+256=512
  - [-1, 2, C3k2, [512, True]]                    # 24: 512→512

  # === 检测头: P3(增强) + P4 + P5 ===
  - [[18, 21, 24], 1, Detect, [nc]]  # 25
