# Ultralytics YOLO 🚀, AGPL-3.0 license
# CMIFE-YOLO v5: 与YOLOv11n基线完全一致的backbone通道, 在neck正确加入CMIFE
# 核心思路: backbone通道数 = YOLOv11n (P3=64ch, P4=128ch, P5=256ch)
#           不做任何backbone缩减, CMIFE仅在neck做特征增强
# 预估参数量: ~2.8M (vs 基线2.59M, 仅+8%)

# Parameters
nc: 10  # VisDrone 10类
scales:
  n: [0.50, 0.25, 1024]  # width=0.25用于C3k2内部bottleneck

# YOLOv11n backbone (与原始YOLOv11n完全一致)
backbone:
  - [-1, 1, Conv, [64, 3, 2]]        # 0: 3→64, P1/2
  - [-1, 1, Conv, [128, 3, 2]]       # 1: 64→128, P2/4
  - [-1, 2, C3k2, [256, False, 0.25]]  # 2: 128→256, bottleneck=64
  - [-1, 1, Conv, [256, 3, 2]]       # 3: 256→256, P3/8
  - [-1, 2, C3k2, [512, False, 0.25]]  # 4: 256→512, bottleneck=128
  - [-1, 1, Conv, [512, 3, 2]]       # 5: 512→512, P4/16
  - [-1, 2, C3k2, [512, True]]       # 6: 512→512, bottleneck=256
  - [-1, 1, Conv, [512, 3, 2]]       # 7: 512→512, P5/32
  - [-1, 2, C3k2, [512, True]]       # 8: 512→512, bottleneck=256
  - [-1, 1, SPPF, [512, 5]]           # 9: 512→512
  - [-1, 2, C2PSA, [512]]              # 10: 512→512 (标准YOLOv11n C2PSA, 输出256ch)

# CMIFE-YOLO v5 head
head:
  # === FPN自顶向下路径 ===
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]   # 11
  - [[-1, 6], 1, Concat, [1]]                    # 12: 512+512=1024
  - [-1, 2, C3k2, [512, False]]                   # 13: 1024→512, neck P4

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]   # 14
  - [[-1, 4], 1, Concat, [1]]                     # 15: 512+512=1024
  - [-1, 2, C3k2, [256, False]]                   # 16: 1024→256, neck P3

  # === CMIFE增强 (P3双级联, 与标准YOLOv11n neck通道完全一致) ===
  # CMIFE #1: 融合backbone_P3(256) + neck_P3(256) → 256ch
  - [[3, 16], 1, CMIFE, [256]]   # 17
  # CMIFE #2: 单输入精炼 256 → 256 (级联增强小目标)
  - [-1, 1, CMIFE, [256]]         # 18

  # === PAN自底向上路径 ===
  - [-1, 1, Conv, [256, 3, 2]]                   # 19: 256→512
  - [[-1, 13], 1, Concat, [1]]                   # 20: 512+512=1024
  - [-1, 2, C3k2, [512, False]]                  # 21: 1024→512, neck P4

  - [-1, 1, Conv, [512, 3, 2]]                   # 22: 512→1024
  - [[-1, 10], 1, Concat, [1]]                   # 23: 1024+256=1280
  - [-1, 2, C3k2, [512, True]]                    # 24: 1280→512, neck P5

  # === 检测头 (P3增强 + P4 + P5) ===
  - [[18, 21, 24], 1, Detect, [nc]]  # 25
